import { OtherQuestion } from './../models/other-question.model';
import { QuestionGroup } from './../models/question-group.model';
import { Question } from './../models/Question.model';

export const questionGroup1 : QuestionGroup={
    title:'پرسە پەیوەستەكان بە خاڵە بەهێزەكانی فووتساڵ لە شاری كەلار',
    questions:[
        {
            id: 1,
            title:'زۆر حەزكردنی خەڵك لە فووتساڵ'
        } as Question,
        {
            id: 2,
            title:'بەدەمەوەهاتنی تازەلاو و گەنجە بەهرەدارەكان'
        } as Question,
        {
            id: 3,
            title:'دەست پێگەیشتنی ئاسانی هەموان بە كەش و شوێنە تایبەتییەكانی وەرزشی فووتساڵ'
        } as Question,
        {
            id: 4,
            title:'حەزی ناوەكی (زاتی) گەنجان و تازەگەنجان بۆ فووتساڵ'
        } as Question,
        {
            id: 5,
            title:'ئامادەبوونی فراوانی تیپەكان و یاریگاكانی فووتساڵ'
        } as Question,
        {
            id: 6,
            title:'بوونی پسپۆڕ و ڕاهێنەری بەتوانای فووتساڵ'
        } as Question,
        {
            id: 7,
            title:'لێهاتوویی پسپۆڕی و فەننی بەرزی ڕاهێنەرانی فووتساڵ'
        } as Question,
        {
            id: 8,
            title:'بەشداربوونی تیپی فووتساڵ لە پێشبڕكێی فەرمیی وڵاتدا'
        } as Question,
        {
            id: 9,
            title:'بەڕێوەچوونی ئاهەنگ و پێشبڕكێی فووتساڵ'
        } as Question,
        {
            id: 10,
            title:'بوونی ناوبژیوانان و بەڕێوبەرانی بەتوانا لە فووتساڵدا'
        } as Question
    ]
    
};

export const questionGroup2 : QuestionGroup={
    title:'پرسە پەیوەندیدارەكان بە خاڵە لاوازەكانی فووتساڵی شاری كەلار',
    questions:[
        {
            id: 1,
            title:'نەبوونی بەرنامەی داڕێژراو بۆ گەشەكردنی فووتساڵ'
        } as Question,
        {
            id: 2,
            title:'هەبوونی بەڕێوبەرانی بێ توانا لە بەڕیوەبردنی فووتساڵ'
        } as Question,
        {
            id: 3,
            title:'كوالێتی نەگونجاوی ئامراز و كەرەستەكانی فووتساڵ'
        } as Question,
        {
            id: 4,
            title:'حسێب بۆ نەكردنی فووتساڵ'
        } as Question,
        {
            id: 5,
            title:'نەبوونی سپۆنسەر و وەبەرهێن لە فووتساڵدا'
        } as Question,
        {
            id: 6,
            title:'سوودنەبینینی پێوست لە پسپۆڕانی هەبووی فووتساڵ'
        } as Question,
        {
            id: 7,
            title:'نەبوونی سیستەمی بەهرە دۆزینەوە لە فووتساڵدا'
        } as Question,
        {
            id: 8,
            title:'چاودێری و كۆنتڕۆڵ'
        } as Question,
        {
            id: 9,
            title:'ڕێكخستنی نەگونجاوی هێز و تواناكان'
        } as Question,
        {
            id: 10,
            title:'حاڵی خراپی ماددیی وەرزشكاران'
        } as Question
    ]
    
};

export const questionGroup3 : QuestionGroup={
    title:'پرسە پەیوندیدارەكان بە هەلەكان لە فووتساڵی شاری كەلار',
    questions:[
        {
            id: 1,
            title:'زیاتربوونی میدیاكانی شارەكە'
        } as Question,
        {
            id: 2,
            title:'گەشەسەندن و ڕوو لە زیاد بوونی زانیاری و پەیوەندییەكان'
        } as Question,
        {
            id: 3,
            title:'هەبوونی یاسا و ڕێسای پشتگیری لە فووتساڵ'
        } as Question,
        {
            id: 4,
            title:'حەزكردنی بەڕێوبەرە پلە بەرزەكان لە وەرزش'
        } as Question,
        {
            id: 5,
            title:'پشتگیری خێزانەكان لە وەرزشكاران'
        } as Question,
        {
            id: 6,
            title:'خۆشویستراوی گشتی و گرنگیدانی كۆمەڵگا بە پاڵەوانان'
        } as Question,
        {
            id: 7,
            title:'کەمبوونەوەی ڕێگری ناوەندی لە فووتساڵدا'
        } as Question,
        {
            id: 8,
            title:'مەرزی هاوبەشی زەمینی لەگەڵ ئێراندا بۆ هاتوچۆی وەرزشی'
        } as Question,
        {
            id: 9,
            title:'جەختكردنەوەی ڕێنماییە ئایینییەكان لەسەر تەندوروستیی تاك'
        } as Question,
        {
            id: 10,
            title:'هەبوونی دەمارگیری نەتەوەیی بۆ پشتگیری كردن لە پاڵەوانان'
        } as Question
        
    ]
    
};

export const questionGroup4 : QuestionGroup={
    title:'پرسە پەیوەندیدارەكان بە خاڵە بەهێزەكانی فووتساڵی شاری كەلار',
    questions:[
        {
            id: 1,
            title:'بەرزبوونەوەی ئاماری بێكاری'
        } as Question,
        {
            id: 2,
            title:'بەرزبوونەوەی نەخۆشی گشتگری كۆرۆنا'
        } as Question,
        {
            id: 3,
            title:'حەز بە ژیانی ڕۆبۆتی و ئامێری و ناچالای كۆمەڵگا'
        } as Question,
        {
            id: 4,
            title:'سیاسی بوونی وەرزش بە تایبەت فووتساڵ'
        } as Question,
        {
            id: 5,
            title:'نەگونجانی كەش و ئاو و هەوای شوێنەكە'
        } as Question,
        {
            id: 6,
            title:'بەرزبوونەوەی نرخی كەرەستە وەرزشییەكان'
        } as Question,
        {
            id: 7,
            title:'دیاردەی كۆچكردنی قارەمانانی وەرزشی فووتساڵ'
        } as Question,
        {
            id: 8,
            title:'بەكارهێنانی شوێنە وەرزشییەكان بۆ شتی تر'
        } as Question,
        {
            id: 9,
            title:'بەرزبوونەوەی نرخەكانی پاراستن و چاودێری كردنی یاریگاكانی وەرزشی فووتساڵ'
        } as Question,
        {
            id: 10,
            title:'بەرزبوونەوەی نرخەكانی فێنككەرەوە و گەرمكەرەوەی یاریگاكان'
        } as Question
        
    ]
    
};

export const otherQuestions: OtherQuestion[]=[
    {
        id:1,
        title:'تكایە ڕوانین بۆ داهاتووی خوازراو لە لایەن لثژنەی تۆپی پێ، سەبارەت بە گەشەی فووتساڵی شاری كەلار، بە ڕیزبەندی و ئەولەویەت بنووسن.'
    } as OtherQuestion,
    {
        id:2,
        title:'ئەركی ڕێكخراو: ڕستە یان دەربڕینێك كە پێیەوە ئامانجی ڕێكخراوێك لە ڕێكخراوێكی هاوشێوە جیاواز دەبێت. (كاری ئێمە چییە؟)'
    } as OtherQuestion,
    {
        id:3,
        title:'تكایە ئەركە خوازراوەكانی لێژنەی تۆپی پێ، دەربارەی گەشەی وەرزشی فووتساڵی شاری كەلار، بەڕیزبەندی ئەولەوییەت بنووسن.'
    } as OtherQuestion,
    {
        id:4,
        title:'ئامانجە درێژخایەنەكان: ئەو بەرەنجامە تایبەتیانەی كە ڕێكخراو هەوڵدەدات بۆ مسۆگەركردنی ئەركەكەی خۆی بەدەستیان بهێنێت. (خولی ئیداری زیاتر لە ساڵێك، بە ئامانجی درێژخایەن دەژمێردرێت).'
    } as OtherQuestion,
    {
        id:5,
        title:'تیكایە ئامانجەە درێژخایەنەكانی لێژنەی تۆپی پێ، دەربارەی گەشەی وەرزشی فووتساڵی شاری كەلار، بە ڕیزبەندی و ئەولەوییەت بنوسن.'
    } as OtherQuestion
];